- Title: Drop Rows or Columns from a pandas DataFrame
- Slug: python-pandas-drop
- Date: 2020-04-13
- Category: Computer Science
- Tags: programming, Python, pandas, DataFrame, reshape, drop
- Author: Ben Du
- Modified: 2020-04-13

# Reshape DataFrame

In [6]:
import pandas as pd
import numpy as np

In [7]:
df1 = pd.DataFrame({'x': [1, 2, 3], 'y': [5, 4, 3]})
df1

   x  y
0  1  5
1  2  4
2  3  3

In [8]:
df2 = pd.DataFrame({'x': [0, 0, 3000], 'y': [78, 4, 3]})
df2

      x   y
0     0  78
1     0   4
2  3000   3

## Drop Rows

In [ ]:
import pandas as pd

data = {
    'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
    'year': [2012, 2012, 2013, 2014, 2014],
    'reports': [4, 24, 31, 2, 3]
}
df = pd.DataFrame(data, index=['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

In [3]:
df.drop(['Cochice', 'Pima'])

            name  reports  year
Santa Cruz  Tina       31  2013
Maricopa    Jake        2  2014
Yuma         Amy        3  2014

## Drop Columns

In [6]:
import pandas as pd

data = {
    'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
    'year': [2012, 2012, 2013, 2014, 2014],
    'reports': [4, 24, 31, 2, 3]
}
df = pd.DataFrame(data, index=['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

In [7]:
df.drop('reports', axis=1, inplace=False)

             name  year
Cochice     Jason  2012
Pima        Molly  2012
Santa Cruz   Tina  2013
Maricopa     Jake  2014
Yuma          Amy  2014

In [9]:
df.drop(df.columns[[0, 1]], axis=1)

            year
Cochice     2012
Pima        2012
Santa Cruz  2013
Maricopa    2014
Yuma        2014